// todo: Сохраните результат шахматной партии в виде двухмерного массива board, называть фигуры можно 
// произвольно, например “black queen”.

const chessBoard = [[[], [], [], [], [], ["rook_b"], [], ["queen_b"]],
						[[], ["pawn_b"], ["knight_w"], [], ["rook_w"], [], ["pawn_b"], ["pawn_b"]],
						[[], ["pawn_w"], ["bishop_b"], [], [], [], [], []],
						[["knight_b"], [], ["rook_b"], [], ["pawn_w"], [], ["knight_b"], []],
						[[], [], [], [], [], [], [], []],
						[["bishop_b"], [], [], ["pawn_b"], [], [], [], []],
						[[], [], [], [], [], [], [], ["pawn_w"]],
						[[], ["rook_w"], [], ["knight_w"], [], [], ["queen_w"], []]]
