// исходный код
const user = {
    id: 7,
    name: 'Bob',
    token: 12343423

};



//todo 9.1 Получите из объекта user значение id и разместите его в константу userId не используя выражение user.id.

//todo 9.2 Создайте новый объект на базе объекта user без свойства token через деструктуризацию объекта

//todo 9.3 Заморозьте объект user, так чтобы в него нельзя было добавить свойства.

//todo 9.4 Создайте на базе объекта user новый объкт с доп. полями login и password

//todo 9.5 Добавьте к объекту user метод getId который возвращает свойство id

//todo 9.6 Добавьте к объекту user метод setId который утанавливает свойство id

//todo 9.7 Проитерируйте объект user так чтобы при итерации можно было получить его ключ и значение.

//todo 9.8 Сериализуйте объект в json

//todo 9.8 Преобразуйте объект в ассоциативный массив.








